app/controllers/products_controller.rb

INSERT INTO "products" ("name", "reference", "brand", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)
    if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "products" SET "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "CADINA FRAGUE FLUIDO MENDOZA (BO 1KG)\nUnidades por Pack10"], ["updated_at", "2022-08-10 20:36:56.814892"], ["id", 12]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new_movement
    @product = Product.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create_movement
    @product = Product.find(params[:id])