app/views/products/show.html.erb

        <tbody>
          <% @product.movements.each do |movement| %>
---
SELECT "movements".* FROM "movements" WHERE "movements"."product_id" = ?  [["product_id", 1]]